Tekla Open API Reference for Tekla Structures 2025
AnalysisCrossSection.Iyy Property
 The moment of inertia about the Y-axis (m4) of the analysis cross section.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Iyy { get; set; }
Public Property Iyy As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisCrossSection Class
Tekla.Structures.Analysis Namespace